/*
// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let a = [2.55, 3452, -2452, 55, 0.335];
let b = ['werwe', '3243', 'sssqqq', 'rory', 'llllwwwww'];
let c = [true, 2323, false, 'true', -3];
console.log(a);
console.log(b);
console.log(c);*/

/*// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль?

let a = [];
a[0] = '-_-';
a[1] = 'owu';
a[2] = 2021;
a[3] = 'september';
a[4] = 'group';
a[5] = true;
console.log(a);*/

/*// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

for (let i = 1; i <= 10; i++) {
    document.write('<div>довільний текст всередині</div>')
}

for (let a = 1; a <= 10; a++) {
    document.write(`<div>довільний текст і індекс ${a} всередині </div>`)
}

let b = 1;
while (b <= 20) {
    document.write('<div><h1>довільний текст всередині</h1></div>');
    b++;
}

let c = 1;
while (c <= 20) {
    document.write(`<div><h1>довільний текст і індекс ${c} всередині</h1></div>`);
    c++;
}*/

/*
/!*
- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи*!/

// let numb = [11, 22, 33, 44, 55, 66, 77, 88, 99, 1010];
// for (i = 0; i < numb.length; i++) {
//     console.log(numb[i]);
// }
// let string = ['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff', 'ggg', 'hhh', 'iii', 'jjj'];
// for (a = 0; a < string.length; a++) {
//     console.log(string[a]);
// }
//
// let all = [111, 'aaa', true, 222, 'bbb', false, 333, 'ccc', (5 < 11), false];
// for (b = 0; b < all.length; b++) {
//     console.log(all[b]);
// }

let array = [(5>33.2222133),'owu',33,true,'ssss',false,(10>=10),11,'33333333333333333',24234132413]
for (i = 0; i < array.length; i++) {
    if (typeof array[i] === 'boolean') {
        console.log(array[i]);
    }
}
for (a = 0; a < array.length; a++) {
    if (typeof array[a] === 'number') {
        console.log(array[a]);
    }
}
for (b = 0; b < array.length; b++) {
    if (typeof array[b] === 'string') {
        console.log(array[b]);
    }
}

*/

/*// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


// let array = [];
// array[0] = true;
// array[1] = 'okten';
// array[2] = 'september2021';
// array[3] = (10<20);
// array[4] = 11;
// array[5] = '22';
// array[6] = -0.324;
// array[7] = false;
// array[8] = true;
// array[9] ='array';
// for (i = 0; i < array.length; i++) {
//     console.log(array[i]);
// }

// for (i = 0; i < 10; i++) {
//     console.log(`поточний крок ${i}`);
//     document.write(`поточний крок ${i}` );
// }

// for (i = 0; i < 100; i++) {
//     console.log(`поточний крок ${i}`);
//     document.write(`поточний крок ${i}` );
// }

// for (i = 0; i < 100; i+=2) {
//     console.log(`поточний крок ${i}`);
//     document.write(`поточний крок ${i}`);
// }


// for (i = 0; i < 100; i++) {
//     if (i % 2 === 0) {
//         console.log(`поточний крок ${i}`);
//         document.write(`<div>поточний крок ${i}</div>`);
//     }
//
// }
// for (i = 0; i < 100; i++) {
//     if (!i % 2 === 0) {
//         console.log(`поточний крок ${i}`);
//         document.write(`<div>поточний крок ${i}</div>`);
//     }
//
// }*/
