// - Дано натуральное число n. Выведите все числа от 1 до n.
// let xxx = (n) => {
//     for (let start = 1; start <= n; start++) {
//         document.write(`${start} </br>`);
//
//     }
// };
// xxx(12)


// // - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
// let ab = (a, b) => {
//     if (a < b) {
//         for (let i = a; i <= b; i++) {
//             document.write(`${i}</br>`);
//         }
//     }
//     else if (b < a) {
//         for (let i = a; i >= b; i--) {
//
//             document.write(`${i}</br>`);
//
//         }
//
//
//     } else {
//         document.write('-_-');
//     }
//
// };
// ab(43,23)

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]



// array = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// let xxx = (arr, i) => {
//     if (i < arr.length-1 && i >= 0 ){
//         for (const j of arr) {
//             if (i === j) {
//                 let namb = arr[j];
//                 arr[j] = arr[j + 1];
//                 arr[j + 1] = namb;
//                 console.log(arr);
//             }
//         }
//     } else {
//         console.log(`-_-`);
//     }
//
// };
// xxx(array, 7);





// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
